hoangducanh2005/bleach_vs_naruto_STM32F429ZI/Core/Src/battle_demo.c
  if (s_player.facing < 0)
  {
    s_getsuga.x = (int16_t)(s_player.x - 18 - (int16_t)GETSUGA_PROJECTILE_WIDTH);
  }
  else
  {
    s_getsuga.x = (int16_t)(s_player.x + 18);
  }
}

static void Battle_UpdateGetsuga(uint32_t nowMs)
{
  if (s_getsuga.active == 0U)
  {
    return;
  }

  s_getsuga.x = (int16_t)(s_getsuga.x + s_getsuga.vx);
  s_getsuga.frameIndex = (uint8_t)(((nowMs - s_getsuga.startedMs) /
                                    BATTLE_GETSUGA_FRAME_MS) %
                                   GETSUGA_PROJECTILE_FRAME_COUNT);

  if ((s_getsuga.x > (int16_t)LCD_PORT_WIDTH) ||
      ((s_getsuga.x + (int16_t)GETSUGA_PROJECTILE_WIDTH) < 0))
  {
    s_getsuga.active = 0U;
  }
}

static void Battle_ResolveProjectileHit(BattleProjectile *projectile,
                                        CombatActor *owner,
                                        CombatActor *target,
                                        uint32_t nowMs)
{
  if ((projectile == 0) || (owner == 0) || (target == 0) ||
      (projectile->active == 0U) ||
      (projectile->hitConnected != 0U))
  {
    return;
  }

  CombatBox projectileBox = {
      (int16_t)(projectile->x + s_getsugaHitbox.box.x),
      (int16_t)(projectile->y + s_getsugaHitbox.box.y),
      s_getsugaHitbox.box.w,
      s_getsugaHitbox.box.h,
  };
  CombatBox hurtboxWorld = CombatActor_GetHurtboxWorld(target);

  if (CombatBox_Overlap(projectileBox, hurtboxWorld) == 0U)
  {
    return;
  }

  CombatActor_ApplyHit(target, owner, &s_getsugaHitbox, nowMs, 0U);
  projectile->hitConnected = 1U;
  projectile->active = 0U;
}

static uint8_t Battle_CaptureGetsuga(const BattleProjectile *projectile,
                                     BattleActorSnapshot *snapshot)
{
  if (snapshot != 0)
  {
    snapshot->valid = 0U;
  }

  if ((projectile == 0) || (snapshot == 0) ||
      (projectile->active == 0U))
  {
    return 0U;
  }

  snapshot->pixels = getsuga_projectile_frames[projectile->frameIndex];
  snapshot->width = GETSUGA_PROJECTILE_WIDTH;
  snapshot->height = GETSUGA_PROJECTILE_HEIGHT;
  snapshot->x = projectile->x;
  snapshot->y = projectile->y;
  snapshot->flipX = (projectile->vx < 0) ? 1U : 0U;
  snapshot->valid = 1U;

  return 1U;
}

static uint8_t Battle_CaptureChidori(const CombatActor *actor,
                                     BattleActorSnapshot *snapshot)
{
  const ChidoriFrame *frames = 0;
  uint8_t frameCount = 0U;
  uint8_t frameIndex = 0U;

  if (snapshot != 0)
  {
    snapshot->valid = 0U;
  }

  if ((actor == 0) || (snapshot == 0) ||
      (actor->character != COMBAT_CHARACTER_SASUKE) ||
      (actor->state != COMBAT_ANIM_SKILL))
  {
    return 0U;
  }

  if (actor->frameIndex < 3U)
  {
    frames = chidori_1_frames;
    frameCount = 4U;
    frameIndex = actor->frameIndex;
  }
  else if (actor->frameIndex < 6U)
  {
    frames = chidori_2_frames;
    frameCount = 3U;
    frameIndex = (uint8_t)(actor->frameIndex - 3U);
  }
  else if (actor->frameIndex < 9U)
  {
    frames = chidori_3_frames;
    frameCount = 3U;
    frameIndex = (uint8_t)(actor->frameIndex - 6U);
  }
  else
  {
    frames = chidori_4_frames;
    frameCount = 2U;
    frameIndex = (uint8_t)(actor->frameIndex - 9U);
  }

  if (frameIndex >= frameCount)
  {
    frameIndex = (uint8_t)(frameCount - 1U);
  }

  const ChidoriFrame *frame = &frames[frameIndex];
  snapshot->pixels = frame->pixels;
  snapshot->width = frame->width;
  snapshot->height = frame->height;
  snapshot->y = (int16_t)(actor->y - 54 - (int16_t)(frame->height / 2U));

  if (actor->facing < 0)
  {
    snapshot->x = (int16_t)(actor->x - 18 - (int16_t)frame->width);
    snapshot->flipX = 1U;
  }
  else
  {
    snapshot->x = (int16_t)(actor->x + 18);
    snapshot->flipX = 0U;
  }

  snapshot->valid = 1U;
  return 1U;
}

static void Battle_DrawActorSnapshot(const BattleActorSnapshot *snapshot)
{
  if ((snapshot == 0) || (snapshot->valid == 0U))
  {
    return;
  }

  SpriteRender_Draw(snapshot->x,
                    snapshot->y,
                    snapshot->pixels,
                    snapshot->width,
                    snapshot->height,
                    snapshot->flipX);
}

static uint8_t Battle_ActorSnapshotEqual(const BattleActorSnapshot *a,
                                         const BattleActorSnapshot *b)
{
  if ((a == 0) || (b == 0))
  {
    return 0U;
  }

  return ((a->valid == b->valid) &&
          (a->pixels == b->pixels) &&
          (a->width == b->width) &&
          (a->height == b->height) &&
          (a->x == b->x) &&
          (a->y == b->y) &&
          (a->flipX == b->flipX))
             ? 1U
             : 0U;
}

static void Battle_DirtyRectAddSnapshot(BattleDirtyRect *rect,
                                        const BattleActorSnapshot *snapshot)
{
  if ((rect == 0) || (snapshot == 0) || (snapshot->valid == 0U) ||
      (snapshot->width == 0U) || (snapshot->height == 0U))
  {
    return;
  }

  int16_t x0 = snapshot->x;
  int16_t y0 = snapshot->y;
  int16_t x1 = (int16_t)(snapshot->x + (int16_t)snapshot->width);
  int16_t y1 = (int16_t)(snapshot->y + (int16_t)snapshot->height);

  if (x0 < 0)
  {
    x0 = 0;
  }
  if (y0 < 0)
  {
    y0 = 0;
  }
  if (x1 > (int16_t)LCD_PORT_WIDTH)
  {
    x1 = (int16_t)LCD_PORT_WIDTH;
  }
  if (y1 > (int16_t)LCD_PORT_HEIGHT)
  {
    y1 = (int16_t)LCD_PORT_HEIGHT;
  }

  if ((x1 <= x0) || (y1 <= y0))
  {
    return;
  }

  if (rect->valid == 0U)
  {
    rect->x = x0;
    rect->y = y0;
    rect->w = (int16_t)(x1 - x0);
    rect->h = (int16_t)(y1 - y0);
    rect->valid = 1U;
    return;
  }

  int16_t rx1 = (int16_t)(rect->x + rect->w);
  int16_t ry1 = (int16_t)(rect->y + rect->h);

  if (x0 < rect->x)
  {
    rect->x = x0;
  }
  if (y0 < rect->y)
  {
    rect->y = y0;
  }
  if (x1 > rx1)
  {
    rx1 = x1;
  }
  if (y1 > ry1)
  {
    ry1 = y1;
  }

  rect->w = (int16_t)(rx1 - rect->x);
  rect->h = (int16_t)(ry1 - rect->y);
}

static void Battle_DrawSnapshotChange(const BattleActorSnapshot *previous,
                                      const BattleActorSnapshot *next,
                                      const BattleActorSnapshot *player,
                                      const BattleActorSnapshot *cpu,
                                      const BattleActorSnapshot *projectile,
                                      const BattleActorSnapshot *chidori)
{
  BattleDirtyRect dirty = {0, 0, 0, 0, 0U};

  Battle_DirtyRectAddSnapshot(&dirty, previous);
  Battle_DirtyRectAddSnapshot(&dirty, next);
  Battle_DrawDirtyRect(dirty, player, cpu, projectile, chidori);
}

