hoangducanh2005/bleach_vs_naruto_STM32F429ZI/Core/Src/battle_demo.c
static void Battle_DrawDirtyRect(BattleDirtyRect rect,
                                 const BattleActorSnapshot *player,
                                 const BattleActorSnapshot *cpu,
                                 const BattleActorSnapshot *projectile,
                                 const BattleActorSnapshot *chidori)
{
  if ((rect.valid == 0U) || (rect.w <= 0) || (rect.h <= 0))
  {
    return;
  }

  for (int16_t row = 0; row < rect.h; row++)
  {
    uint16_t y = (uint16_t)(rect.y + row);

    for (int16_t col = 0; col < rect.w; col++)
    {
      uint16_t x = (uint16_t)(rect.x + col);
      s_compositeRun[col] =
          s_backgroundPixels[((uint32_t)y * LCD_PORT_WIDTH) + x];
    }

    Battle_ComposeActorRow(rect, player, y);
    Battle_ComposeActorRow(rect, cpu, y);
    Battle_ComposeActorRow(rect, projectile, y);
    Battle_ComposeActorRow(rect, chidori, y);

    LCD_Port_DrawPixels((uint16_t)rect.x,
                        y,
                        (uint16_t)rect.w,
                        s_compositeRun);
  }
}

static void Battle_ComposeActorRow(BattleDirtyRect rect,
                                   const BattleActorSnapshot *snapshot,
                                   uint16_t screenY)
{
  int16_t y = (int16_t)screenY;

  if ((snapshot == 0) || (snapshot->valid == 0U) ||
      (y < snapshot->y) ||
      (y >= (int16_t)(snapshot->y + (int16_t)snapshot->height)))
  {
    return;
  }

  int16_t x0 = snapshot->x;
  int16_t x1 = (int16_t)(snapshot->x + (int16_t)snapshot->width);
  int16_t rectX1 = (int16_t)(rect.x + rect.w);

  if (x0 < rect.x)
  {
    x0 = rect.x;
  }
  if (x1 > rectX1)
  {
    x1 = rectX1;
  }

  if (x1 <= x0)
  {
    return;
  }

  uint16_t localY = (uint16_t)(y - snapshot->y);

  for (int16_t screenX = x0; screenX < x1; screenX++)
  {
    uint16_t localX = (uint16_t)(screenX - snapshot->x);
    uint16_t srcX = (snapshot->flipX != 0U)
                        ? (uint16_t)(snapshot->width - 1U - localX)
                        : localX;
    uint16_t color = snapshot->pixels[((uint32_t)localY * snapshot->width) + srcX];

    if (color != SPRITE_COLOR_KEY_RGB565)
    {
      s_compositeRun[screenX - rect.x] = color;
    }
  }
}

static void Battle_DrawDebugBoxes(void)
{
#if BATTLE_DEBUG_BOXES
  const CombatHitboxDef *unusedHitbox = 0;
  Battle_DrawBox(CombatActor_GetHurtboxWorld(&s_player), RGB565_HURTBOX);
  Battle_DrawBox(CombatActor_GetHurtboxWorld(&s_cpu), RGB565_HURTBOX);
  Battle_DrawBox(CombatActor_GetHitboxWorld(&s_player, &unusedHitbox),
                 RGB565_HITBOX);
  Battle_DrawBox(CombatActor_GetHitboxWorld(&s_cpu, &unusedHitbox),
                 RGB565_HITBOX);
#endif
}

#if BATTLE_DEBUG_BOXES
static void Battle_DrawBox(CombatBox box, uint16_t color)
{
  if ((box.w <= 0) || (box.h <= 0))
  {
    return;
  }

  int16_t x0 = box.x;
  int16_t y0 = box.y;
  int16_t x1 = (int16_t)(box.x + box.w);
  int16_t y1 = (int16_t)(box.y + box.h);

  if ((x1 <= 0) || (y1 <= 0) ||
      (x0 >= (int16_t)LCD_PORT_WIDTH) ||
      (y0 >= (int16_t)LCD_PORT_HEIGHT))
  {
    return;
  }

  x0 = CombatBox_ClampI16(x0, 0, (int16_t)(LCD_PORT_WIDTH - 1U));
  y0 = CombatBox_ClampI16(y0, 0, (int16_t)(LCD_PORT_HEIGHT - 1U));
  x1 = CombatBox_ClampI16(x1, 0, (int16_t)(LCD_PORT_WIDTH - 1U));
  y1 = CombatBox_ClampI16(y1, 0, (int16_t)(LCD_PORT_HEIGHT - 1U));

  ILI9341_DrawHollowRectangleCoord((uint16_t)x0,
                                   (uint16_t)y0,
                                   (uint16_t)x1,
                                   (uint16_t)y1,
                                   color);
}
#endif

static void Battle_DrawHud(void)
{
  ILI9341_DrawFilledRectangleCoord(6U, 6U, 314U, 35U, RGB565_BLACK);
  ILI9341_DrawText("P1 NARUTO", FONT2, 12U, 10U, RGB565_WHITE, RGB565_BLACK);
  ILI9341_DrawText("CPU SASUKE", FONT2, 214U, 10U, RGB565_WHITE, RGB565_BLACK);
  ILI9341_DrawText("BTN:ATK JMP SKL DSH", FONT2, 93U, 24U, RGB565_LINE,
                   RGB565_BLACK);
  Battle_DrawHealthBar(12U, 22U, s_player.hp, RGB565_ACCENT_CYAN);
  Battle_DrawHealthBar(202U, 22U, s_cpu.hp, RGB565_ACCENT_ORANGE);
}

static void Battle_DrawHealthBar(uint16_t x, uint16_t y, uint16_t hp,
                                 uint16_t borderColor)
{
  uint16_t fill = (hp > 30U) ? RGB565_HP_GOOD : RGB565_HP_WARN;
  uint16_t width = (uint16_t)((hp > 100U) ? 100U : hp);

  ILI9341_DrawHollowRectangleCoord(x, y, (uint16_t)(x + 102U),
                                   (uint16_t)(y + 8U), borderColor);
  LCD_Port_FillRect((uint16_t)(x + 1U), (uint16_t)(y + 1U), 100U, 6U,
                    RGB565_HP_BACK);
  if (width != 0U)
  {
    LCD_Port_FillRect((uint16_t)(x + 1U), (uint16_t)(y + 1U), width, 6U,
                      fill);
  }
}

static void Battle_DrawBackground(void)
{
  Battle_DrawStaticSky();
  Battle_DrawSun(268U, 34U);
  Battle_DrawCloud(30, 36U);
  Battle_DrawCloud(178, 58U);
  Battle_DrawMountains();
  Battle_DrawDojoWall();
  Battle_DrawGround();
  Battle_DrawArenaMarks();
}

static void Battle_BuildBackgroundCache(void)
{
  for (uint16_t y = 0U; y < LCD_PORT_HEIGHT; y++)
  {
    for (uint16_t x = 0U; x < LCD_PORT_WIDTH; x++)
    {
      s_backgroundPixels[((uint32_t)y * LCD_PORT_WIDTH) + x] =
          Battle_GetBackgroundPixel(x, y);
    }
  }
}

static void Battle_DrawStaticSky(void)
{
  LCD_Port_FillRect(0U, 0U, LCD_PORT_WIDTH, 48U, RGB565_SKY_TOP);
  LCD_Port_FillRect(0U, 48U, LCD_PORT_WIDTH, 48U, RGB565_SKY_MID);
  LCD_Port_FillRect(0U, 96U, LCD_PORT_WIDTH, 52U, RGB565_SKY_LOW);
}

static void Battle_DrawSun(uint16_t x, uint16_t y)
{
  Battle_FillSafe((int16_t)x - 10, (int16_t)y - 10, 20, 20,
                  RGB565_ACCENT_ORANGE);
  Battle_FillSafe((int16_t)x - 14, (int16_t)y - 4, 28, 8,
                  RGB565_ACCENT_ORANGE);
  Battle_FillSafe((int16_t)x - 4, (int16_t)y - 14, 8, 28,
                  RGB565_ACCENT_ORANGE);
}

static void Battle_DrawCloud(int16_t x, uint16_t y)
{
  Battle_FillSafe(x + 8, (int16_t)y + 7, 45, 9, RGB565_CLOUD_SHADOW);
  Battle_FillSafe(x, (int16_t)y + 8, 24, 9, RGB565_CLOUD);
  Battle_FillSafe(x + 13, (int16_t)y + 2, 27, 15, RGB565_CLOUD);
  Battle_FillSafe(x + 34, (int16_t)y + 7, 27, 10, RGB565_CLOUD);
  Battle_FillSafe(x + 7, (int16_t)y + 15, 48, 5, RGB565_CLOUD);
}

static void Battle_DrawMountains(void)
{
  for (uint16_t x = 0U; x < LCD_PORT_WIDTH; x += 8U)
  {
    uint16_t h1 = (uint16_t)(22U + ((x * 17U) % 39U));
    uint16_t h2 = (uint16_t)(14U + ((x * 11U) % 31U));
    Battle_FillSafe((int16_t)x, (int16_t)(148U - h1), 8, (int16_t)h1,
                    RGB565_MOUNTAIN_DARK);
    Battle_FillSafe((int16_t)x, (int16_t)(148U - h2), 4, (int16_t)h2,
                    RGB565_MOUNTAIN_LIGHT);
  }
}

static void Battle_DrawDojoWall(void)
{
  LCD_Port_FillRect(0U, 148U, LCD_PORT_WIDTH, 34U, RGB565_WALL_DARK);

  for (uint16_t x = 0U; x < LCD_PORT_WIDTH; x += 32U)
  {
    LCD_Port_FillRect(x, 148U, 2U, 34U, RGB565_WALL_LIGHT);
  }

  LCD_Port_FillRect(0U, 148U, LCD_PORT_WIDTH, 2U, RGB565_WALL_LIGHT);
  LCD_Port_FillRect(0U, 180U, LCD_PORT_WIDTH, 2U, RGB565_BLACK);
}

static void Battle_DrawGround(void)
{
  LCD_Port_FillRect(0U, 182U, LCD_PORT_WIDTH, 58U, RGB565_GROUND);
  LCD_Port_FillRect(0U, 182U, LCD_PORT_WIDTH, 6U, RGB565_GROUND_TOP);
  LCD_Port_FillRect(0U, 232U, LCD_PORT_WIDTH, 8U, RGB565_GROUND_DARK);
}

static void Battle_DrawArenaMarks(void)
{
  LCD_Port_FillRect(40U, 190U, 240U, 2U, RGB565_LINE);
  LCD_Port_FillRect(158U, 186U, 4U, 42U, RGB565_LINE);
  Battle_FillSafe(58, 199, 42, 4, RGB565_ACCENT_CYAN);
  Battle_FillSafe(220, 199, 42, 4, RGB565_ACCENT_ORANGE);
}

