hoangducanh2005/bleach_vs_naruto_STM32F429ZI/Core/Src/battle_demo.c
static uint16_t Battle_GetBackgroundPixel(uint16_t x, uint16_t y)
{
  uint16_t color = RGB565_SKY_LOW;

  if (y < 48U)
  {
    color = RGB565_SKY_TOP;
  }
  else if (y < 96U)
  {
    color = RGB565_SKY_MID;
  }
  else if (y < 148U)
  {
    uint16_t mountainX = (uint16_t)((x / 8U) * 8U);
    uint16_t localX = (uint16_t)(x - mountainX);
    uint16_t h1 = (uint16_t)(22U + ((mountainX * 17U) % 39U));
    uint16_t h2 = (uint16_t)(14U + ((mountainX * 11U) % 31U));

    if ((localX < 4U) && (y >= (uint16_t)(148U - h2)))
    {
      color = RGB565_MOUNTAIN_LIGHT;
    }
    else if (y >= (uint16_t)(148U - h1))
    {
      color = RGB565_MOUNTAIN_DARK;
    }
  }
  else if (y < 182U)
  {
    color = RGB565_WALL_DARK;

    if ((x % 32U) < 2U)
    {
      color = RGB565_WALL_LIGHT;
    }

    if ((y < 150U) || (y >= 180U))
    {
      color = (y < 150U) ? RGB565_WALL_LIGHT : RGB565_BLACK;
    }
  }
  else
  {
    color = RGB565_GROUND;

    if (y < 188U)
    {
      color = RGB565_GROUND_TOP;
    }
    else if (y >= 232U)
    {
      color = RGB565_GROUND_DARK;
    }

    if ((y >= 190U) && (y < 192U) && (x >= 40U) && (x < 280U))
    {
      color = RGB565_LINE;
    }

    if ((x >= 158U) && (x < 162U) && (y >= 186U) && (y < 228U))
    {
      color = RGB565_LINE;
    }

    if ((x >= 58U) && (x < 100U) && (y >= 199U) && (y < 203U))
    {
      color = RGB565_ACCENT_CYAN;
    }

    if ((x >= 220U) && (x < 262U) && (y >= 199U) && (y < 203U))
    {
      color = RGB565_ACCENT_ORANGE;
    }
  }

  if (Battle_RectContains(x, y, 258, 24, 20, 20) != 0U)
  {
    color = RGB565_ACCENT_ORANGE;
  }
  if (Battle_RectContains(x, y, 254, 30, 28, 8) != 0U)
  {
    color = RGB565_ACCENT_ORANGE;
  }
  if (Battle_RectContains(x, y, 264, 20, 8, 28) != 0U)
  {
    color = RGB565_ACCENT_ORANGE;
  }

  if (Battle_RectContains(x, y, 38, 43, 45, 9) != 0U)
  {
    color = RGB565_CLOUD_SHADOW;
  }
  if (Battle_RectContains(x, y, 30, 44, 24, 9) != 0U)
  {
    color = RGB565_CLOUD;
  }
  if (Battle_RectContains(x, y, 43, 38, 27, 15) != 0U)
  {
    color = RGB565_CLOUD;
  }
  if (Battle_RectContains(x, y, 64, 43, 27, 10) != 0U)
  {
    color = RGB565_CLOUD;
  }
  if (Battle_RectContains(x, y, 37, 51, 48, 5) != 0U)
  {
    color = RGB565_CLOUD;
  }

  if (Battle_RectContains(x, y, 186, 65, 45, 9) != 0U)
  {
    color = RGB565_CLOUD_SHADOW;
  }
  if (Battle_RectContains(x, y, 178, 66, 24, 9) != 0U)
  {
    color = RGB565_CLOUD;
  }
  if (Battle_RectContains(x, y, 191, 60, 27, 15) != 0U)
  {
    color = RGB565_CLOUD;
  }
  if (Battle_RectContains(x, y, 212, 65, 27, 10) != 0U)
  {
    color = RGB565_CLOUD;
  }
  if (Battle_RectContains(x, y, 185, 73, 48, 5) != 0U)
  {
    color = RGB565_CLOUD;
  }

  return color;
}

static uint8_t Battle_RectContains(uint16_t x, uint16_t y, int16_t rectX,
                                   int16_t rectY, int16_t rectW,
                                   int16_t rectH)
{
  return (((int16_t)x >= rectX) &&
          ((int16_t)x < (int16_t)(rectX + rectW)) &&
          ((int16_t)y >= rectY) &&
          ((int16_t)y < (int16_t)(rectY + rectH)))
             ? 1U
             : 0U;
}

static void Battle_FillSafe(int16_t x, int16_t y, int16_t width,
                            int16_t height, uint16_t color)
{
  if ((width <= 0) || (height <= 0))
  {
    return;
  }

  int16_t x2 = (int16_t)(x + width);
  int16_t y2 = (int16_t)(y + height);

  if ((x >= (int16_t)LCD_PORT_WIDTH) || (y >= (int16_t)LCD_PORT_HEIGHT) ||
      (x2 <= 0) || (y2 <= 0))
  {
    return;
  }

  if (x < 0)
  {
    width = (int16_t)(width + x);
    x = 0;
  }

  if (y < 0)
  {
    height = (int16_t)(height + y);
    y = 0;
  }

  if ((x + width) > (int16_t)LCD_PORT_WIDTH)
  {
    width = (int16_t)((int16_t)LCD_PORT_WIDTH - x);
  }

  if ((y + height) > (int16_t)LCD_PORT_HEIGHT)
  {
    height = (int16_t)((int16_t)LCD_PORT_HEIGHT - y);
  }

  LCD_Port_FillRect((uint16_t)x, (uint16_t)y, (uint16_t)width,
                    (uint16_t)height, color);
}
